'''
Напишите программу, которая запрашивает у пользователя длины двух катетов в прямоугольном треугольнике и выводит его площадь.
'''

a = int(input('Укажите длину катета а: '))
b = int(input('Укажите длину катета b: '))
print('Площадь треугольника', (a*b)/2)