'''
Маше для защиты курсовой работы нужно написать программу для расчёта экономической модели по формуле
'''
a = 8
b = 10
c = 12
d = 18
res = int(-3+(a**2))* b - (2**3) / (c - 2*d)
print(res)